|Variable|Definition|Key|
|---|---|---|
|survival|Survival|0 = No, 1 = Yes|
|pclass|Ticket class|1 = 1st, 2 = 2nd, 3 = 3rd|
|gender|gender ||
|Age |Age in years| |
|sibsp |number of siblings / spouses aboard|	|
|parch |number of parents / children aboard| |
|ticket|Ticket number ||
|fare | fare| 	|
|cabin |Cabin number|	|
|embarked|Port of Embarkation|C = Cherbourg, Q = Queenstown, S = Southampton|
|boat | Lifeboat||
|body | Body Identification Number||
|home.dest| Home/destination||

- Read data and describe it
- Find columns with missingdata
- Print shape of dataset
- drop columns with more than 25% missing data
- drop columns having independent values(which do not affect the survival rate).


- check data types of all columns
- convert price to numeric
- find columns still having missing/na values and also count of missing data
- fill na with mean for fare and age column column.
- drop na values for embarked column.
- dump the dataframe to a csv file 'titanic_filtered.csv'.


- for surviced column replace 0 with D and 1 with A
- find the frequency of different values in survived column
- group by gender and survived and see the counts in each category
- find different pclass and no of people in each class

- find top 5 people with highest values of age. Count no of male and females in the top 5
- find max age male and female who survived
- get average age by gender
- get average age by people survived vs not-survived

In [154]:
# Read data and describe it
import pandas as pd
df = pd.read_csv('titanic_dataset.csv', index_col = 'Unnamed: 0')
df.head()

,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,$211.34,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,$151.55,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,$151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,$151.55,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,$151.55,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [25]:
df.columns

Index(['pclass', 'survived', 'name', 'gender', 'age', 'sibsp', 'parch',
       'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

In [12]:
# df.drop('Unnamed: 0', axis = 1, inplace = True)

In [26]:
df.describe()

,pclass,survived,age,sibsp,parch,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,121.000000
mean,2.294882,0.381971,29.881135,0.498854,0.385027,160.809917
std,0.837836,0.486055,14.413500,1.041658,0.865560,97.696922
min,1.000000,0.000000,0.166700,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,328.000000

In [22]:
# Find columns with missing data
df.isna().sum()

pclass          0
survived        0
name            0
gender          0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [27]:
# Print shape of dataset
df.shape  # first column is used as index

(1309, 14)

In [35]:
# drop columns with more than 25% missing data
df.isna().sum()/df.pclass.count() * 100

pclass        0.000000
survived      0.000000
name          0.000000
gender        0.000000
age          20.091673
sibsp         0.000000
parch         0.000000
ticket        0.000000
fare          0.076394
cabin        77.463713
embarked      0.152788
boat         62.872422
body         90.756303
home.dest    43.086325
dtype: float64

In [32]:
df.pclass.count()

1309

In [42]:
(df.isna().sum()/df.pclass.count() * 100  > 25)

pclass       False
survived     False
name         False
gender       False
age          False
sibsp        False
parch        False
ticket       False
fare         False
cabin         True
embarked     False
boat          True
body          True
home.dest     True
dtype: bool

In [45]:
df.columns[df.isna().sum()/df.pclass.count() * 100  > 25]

Index(['cabin', 'boat', 'body', 'home.dest'], dtype='object')

In [158]:
df.drop(df.columns[df.isna().sum()/df.pclass.count() * 100  > 25],axis=1, inplace = True)

In [159]:
df.head()

,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.34,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.55,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.55,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.55,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.55,S

In [50]:
df.shape

(1309, 10)

# drop columns having independent values(which do not affect the survival rate).
df.corr()

In [75]:
df.corr()

            pclass  survived       age     sibsp     parch
pclass    1.000000 -0.312469 -0.408106  0.060832  0.018322
survived -0.312469  1.000000 -0.055513 -0.027825  0.082660
age      -0.408106 -0.055513  1.000000 -0.243699 -0.150917
sibsp     0.060832 -0.027825 -0.243699  1.000000  0.373587
parch     0.018322  0.082660 -0.150917  0.373587  1.000000

In [58]:
# check data types of all columns
df.dtypes

pclass        int64
survived      int64
name         object
gender       object
age         float64
sibsp         int64
parch         int64
ticket       object
fare         object
embarked     object
dtype: object

In [59]:
# convert price to numeric
df.fare.head()

0    $211.34
1    $151.55
2    $151.55
3    $151.55
4    $151.55
Name: fare, dtype: object

In [155]:
import re
df.fare = pd.to_numeric(df.fare.str.replace(r'\$',''))
df.dtypes

pclass         int64
survived       int64
name          object
gender        object
age          float64
sibsp          int64
parch          int64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

In [95]:
df.head()

,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.34,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.55,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.55,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.55,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.55,S

In [175]:
# find columns still having missing/na values and also count of missing data
df.isna().sum()

pclass      0
survived    0
name        0
gender      0
age         0
sibsp       0
parch       0
ticket      0
fare        0
embarked    2
dtype: int64

In [106]:
# fill na with mean for fare and age column 
df.fare.mean()

33.29626146789031

In [139]:
df[df.fare.isna() ]

,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,embarked
1225,3,0,"Storey, Mr. Thomas",male,60.5,0,0,3701,NaN,S

In [130]:
df[df.pclass==3].fare.mean()

13.30413841807905

In [145]:
# df[df.fare.isna()].fare= df[df.pclass==3].fare.mean() # mean is applied to a slice of df, not to the original df

In [161]:
df.loc[df[df.fare.isna()].index,'fare'] = df[df.pclass==3].fare.mean()

In [157]:
df[df.fare.isna() ].index

Int64Index([1225], dtype='int64')

In [164]:
df.loc[1225]

pclass                       3
survived                     0
name        Storey, Mr. Thomas
gender                    male
age                       60.5
sibsp                        0
parch                        0
ticket                    3701
fare                   13.3041
embarked                     S
Name: 1225, dtype: object

In [171]:
df.loc[df[df.age.isna()].index,'age'] = round(df.age.mean(),1)

In [167]:
df.age.mean()

29.8811345124283

In [166]:
round(df.age.mean(),1)

29.9

In [174]:
df[df.age==29.9].age.count()

263

In [180]:
# drop na values for embarked column.
df[df.embarked.isna()].index

Int64Index([168, 284], dtype='int64')

In [185]:
df.age.count()

1307

In [184]:
df.drop(df[df.embarked.isna()].index, inplace = True)

In [186]:
# dump the dataframe to a csv file 'titanic_filtered.csv'.
df.to_csv('titanic_filtered_LM.csv')

In [ ]:
# Name, ticket columns are not dropped
# for filling df.Fare NaN values instead of df.Fare.mean(), df[df.pclass==3].fare.mean() is used